In [9]:
import pandas as pd
import sys
import sqlite3

print('>> pandas version:', pd.__version__)
print('>> sqlite3 version:', sqlite3.version)
print('>> sys version:', sys.version)

>> pandas version: 0.23.4
>> sqlite3 version: 2.6.0
>> sys version: 3.6.6 |Anaconda custom (64-bit)| (default, Jun 28 2018, 11:27:44) [MSC v.1900 64 bit (AMD64)]

In [11]:
db = sqlite3.connect('MyDB.db')
print('Connected db')

crsr = db.cursor()

sql_command = """CREATE TABLE FORBES (
RANK INTEGER PRIMARY KEY,
FNAME VARCHAR(20),
LNAME VARCHAR(20),
AGE INTEGER,
GENDER CHAR(1),
DOB DATE
);
"""
crsr.execute(sql_command)  # warning , your sql doesn't handle 'already exists' condition,
print("created table")      #  you can't run this block again, ever

Connected db
created table

In [12]:
#insertion
sql_command="""INSERT INTO FORBES VALUES(1,"ANSH","SACHDEVA",20,"M","05-07-1998");"""
crsr.execute(sql_command)
print("added data successfully")

# once again we didn't handle non unique rows

added data successfully

In [13]:
sql_command="""INSERT INTO FORBES VALUES(2,"ANSH2","SACHDEVA",20,"M","05-07-1998");"""
crsr.execute(sql_command)
print("added data successfully")

sql_command="""INSERT INTO FORBES VALUES(3,"ANSH3","SACHDEVA",20,"M","05-07-1998");"""
crsr.execute(sql_command)
print("added data successfully")

sql_command="""INSERT INTO FORBES VALUES(4,"ANSH4","SACHDEVA",20,"M","05-07-1998");"""
crsr.execute(sql_command)
print("added data successfully")

sql_command="""INSERT INTO FORBES VALUES(5,"ANSH5","SACHDEVA",20,"M","05-07-1998");"""
crsr.execute(sql_command)
print("added data successfully")

sql_command="""INSERT INTO FORBES VALUES(6,"ANSH6","SACHDEVA",20,"M","05-07-1998");"""
crsr.execute(sql_command)
print("added data successfully")

added data successfully
added data successfully
added data successfully
added data successfully
added data successfully

In [14]:
db.commit()

In [17]:
# can't check if cursor is open or close
crsr.close()
db.close()
db = sqlite3.connect('MyDB.db')
print('Connected db')
crsr = db.cursor()

Connected db

In [23]:
query="SELECT * FROM FORBES"
crsr.execute(query)
print('succesfully retrieved ad stored values internally')
data = crsr.fetchall()  # will look inside cursor object and retrieve all the stored query results

succesfully retrieved ad stored values internally

In [24]:
# creating dataframe out of database
dframe=pd.DataFrame(data)
dframe

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
      <th>3</th>
      <th>4</th>
      <th>5</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>ANSH</td>
      <td>SACHDEVA</td>
      <td>20</td>
      <td>M</td>
      <td>05-07-1998</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2</td>
      <td>ANSH2</td>
      <td>SACHDEVA</td>
      <td>20</td>
      <td>M</td>
      <td>05-07-1998</td>
    </tr>
    <tr>
      <th>2</th>
      <td>3</td>
      <td>ANSH3</td>
      <td>SACHDEVA</td>
      <td>20</td>
      <td>M</td>
      <td>05-07-1998</td>
    </tr>
    <tr>
      <th>3</th>
      <td>4</td>
      <td>ANSH4</td>
      <td>SACHDEVA</td>
      <td>20</td>
      <td>M</td>
      <td>05-07-1998</td>
    </tr>
    <tr>
      <th>4</th>
      <td>5</td>
      <td>ANSH5</td>
      <td>SACHDEVA</td>
      <td>20</td>
      <td>M</td>
      <td>05-07-1998</td>
    </tr>
    <tr>
      <th>5</th>
      <td>6</td>
      <td>ANSH6</td>
      <td>SACHDEVA</td>
      <td>20</td>
      <td>M</td>
      <td>05-07-1998</td>
    </tr>
  </tbody>
</table>
</div>

In [25]:
crsr.close()
db.close()

In [26]:
print(sqlite3.connect("NEW.db"))

<sqlite3.Connection object at 0x000002721602F1F0>